/*******************************************************************************
 * File : App.h
 * Breif : Appクラスのヘッダーファイルです。
 * Copyright (c) 2024 mikan-orange
 * This software is released under the MIT License, see LICENSE.
 ******************************************************************************/

#pragma once

// -----------------------------------------------------------------------------
// Includes
// -----------------------------------------------------------------------------
#include "pch.h"

// -----------------------------------------------------------------------------
// Definitions
// -----------------------------------------------------------------------------

#define MAX_APPSTRING	128			// 文字列の長さ
#define WINCLASS_NAME	TEXT("NumberPlaceClass")	// ウィンドウクラス名
#define WINDOW_TITLE	TEXT("Number Place")		// ウィンドウタイトル

// -----------------------------------------------------------------------------
// Declarations
// -----------------------------------------------------------------------------

// Appクラスの宣言です。
class App {
private:
	HINSTANCE m_hInst;						// インスタンスハンドル

public:
	App();
	~App();
	BOOL Init();
	void Run();
	ATOM AppRegisterClass() const;
};
