/*******************************************************************************
 * File : pch.h
 * Breif : プリコンパイル済みヘッダーファイルです。
 * Copyright (c) 2024 mikan-orange
 * This software is released under the MIT License, see LICENSE.
 ******************************************************************************/

#pragma once

// -----------------------------------------------------------------------------
// Includes
// -----------------------------------------------------------------------------

// プリコンパイルするヘッダーファイルをincludeします。

#include "framework.h"
#include "application.h"
#include "utility.h"
