/*******************************************************************************
 * File : utility.h
 * Breif : ユーティリティ関連のヘッダーファイルです。
 * Copyright (c) 2024 mikan-orange
 * This software is released under the MIT License, see LICENSE.
 ******************************************************************************/

#pragma once

// -----------------------------------------------------------------------------
// Includes
// -----------------------------------------------------------------------------
#include "pch.h"

// -----------------------------------------------------------------------------
// Definitions
// -----------------------------------------------------------------------------

// Debugビルド版のみデバッグ出力します。
#if defined(DEBUG) || defined(_DEBUG)
#define DebugPrintf(fmt, ...)	debugprintf(fmt, __VA_ARGS__)
#else
#define DebugPrintf(fmt, ...)
#endif

// Release/Debug版どちらでも出力します。
#define Printf(fmt, ...) debugprintf(fmt, __VA_ARGS__)

// -----------------------------------------------------------------------------
// Declarations
// -----------------------------------------------------------------------------

void debugprintf(const char* format, ...);

